/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pchung <pchung@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/18 22:22:25 by pchung            #+#    #+#             */
/*   Updated: 2024/06/18 22:22:44 by pchung           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void ft_bzero(void *s,size_t n){

//n がゼロの場合、bzero() は何もしません。
if(n==0){
return 0;
}

//bzero() 関数は、n バイトをゼロクリアして文字列 s に書き込みます。
// sを事前に型変換する必要がある
s[n]='\0';

}